#define _CRT_SECURE_NO_WARNINGS

#include <stdio.h>

//int main()
//{
//	//int a = 6 / 5;//1.2?
//	//printf("%d\n", a);
//
//	//float a = 6 / 5;
//	//printf("%f", a);
//
//	float a = 6.0 / 5;//想到到小数，保证除数，被除数至少一个小数
//	printf("%f", a);
//
//	return 0;
//}


//int main()
//{
//	int a = 7 % 3;//两端操作数必须是整数
//	printf("%d\n", a);
//
//	return 0;
//}


////左移操作符
//int main()
//{
//	int a = 2;
//	//把a的二进制位，向左移动一位
//	int b = a << 1;
//
//	printf("a = %d\n", a);
//	printf("b = %d\n", b);
//
//	return 0;
//}


////右移操作符
//int main()
//{
//	int a = -1;
//	//把a的二进制位，向右移动一位
//	int b = a >> 1;
//	//当前的右移操作符，使用的是算数右移
//	printf("b = %d\n", b);
//
//	return 0;
//}


//int main()
//{
//	int a = 10;
//	int b = a << -5;//error
//
//	return 0;
//}


//int main()
//{
//	int a = 3;
//	int b = 5;
//
//
//	//| - 按（二进制）位异或
//	// 对应的二进制位进行异或
//	// 规则：相同为0，相异为1
//	int c = a ^ b;
//	printf("c = %d\n", c);
//	//3:00000000 00000000 00000000 00000011
//	//5:00000000 00000000 00000000 00000101
//	//  00000000 00000000 00000000 00000110
//
//
//	//| - 按（二进制）位或
//	//int c = a | b;
//	//printf("c = %d\n", c);
//	//3:00000000 00000000 00000000 00000011
//	//5:00000000 00000000 00000000 00000101
//	//  00000000 00000000 00000000 00000111
//
//	//& - 按（二进制）位与
//	//int c = a & b;
//	//printf("c = %d\n", c);
//	//3:00000000 00000000 00000000 00000011
//	//5:00000000 00000000 00000000 00000101
//	//  00000000 00000000 00000000 00000001
//	return 0;
//}


////交换
//int main()
//{
//	int a = 3;
//	int b = 5;
//	//交换
//	printf("交换前：a = %d, b = %d\n", a, b);
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//	printf("交换后：a = %d, b = %d\n", a, b);
//
//	//printf("交换前：a = %d, b = %d\n", a, b);
//	////数值大会溢出
//	//a = a + b;
//	//b = a - b;
//	//a = a - b;
//	//printf("交换后：a = %d, b = %d\n", a, b);
//
//	return 0;
//}


//int main()
//{
//	int a = 3;
//	//a ^ a = 0;
//	//0 ^ a = a;
//	//000
//	//011
//	//011
//	// 
//	//011
//	//011
//	//000
//
//	return 0;
//}


int main()
{
	int a = 13;
	//00000000 00000000 00000000 00001101
	//00000000 00000000 00000000 00000001
	//00000000 00000000 00000000 00000001
	//&  >>
	int i = 0;
	int count = 0;
	for (i = 0; i < 31; i++)
	{
		if (a & 1 == 1)
		{
			count++;
		}
		a = a >> 1;
	}
	printf("count  = %d\n", count);

	return 0;
}