#define _CRT_SECURE_NO_WARNINGS

#include <stdio.h>

//整形家族
//浮点型家族
//构造类型 - 自定义类型
//	数组
//	struct 结构体类型
//	enum 枚举
//	union 联合体
// 
//指针类型
// 
//空类型
//void
//函数返回类型 void test()
//函数参数void test(void)
//指针 void* p
//int main()
//{
//	int arr[10];//int [10]
//	int arr2[5];//int [5]
//
//	return 0;
//}


//int main()
//{
//	int a = -10;
//	//
//	//10000000 00000000 00000000 00001010 - 原码
//	//11111111 11111111 11111111 11110101 - 反码
//	//11111111 11111111 11111111 11110110 - 补码
//	//ff ff ff f6
//
//
//	return 0;
//}

//数据在内存中以二进制的形式存储
//对于整数来说：
//整数二进制有3种表示形式：原码、反码、补码
//正整数：原码、反码、补码相同
//负整数：原码、反码、补码要进行计算的
//按照数据的数值直接写出的二进制序列就是原码
//原码的符号位不变，其他位按位取反，得到的就是反码
//反码+1，得到的就是反码
//整数在内存中存储的是补码


//int main()
//{
//	//1 - 1;
//	//1 + (-1)
//	//补码相加
//	//00000000 00000000 00000000 00000001 
//	//11111111 11111111 11111111 11111111
//	//10000000 00000000 00000000 00000000 0 进1多一位，丢去
//	//00000000 00000000 00000000 00000000 
//	//
//	//-1的原码、反码、补码
//	//10000000 00000000 00000000 00000001
//	//11111111 11111111 11111111 11111110
//	//11111111 11111111 11111111 11111111
//	//  
//	//原码进行计算
//	//00000000 00000000 00000000 00000001
//	//10000000 00000000 00000000 00000001
//	//10000000 00000000 00000000 00000010
//	//
//	//-2 错误，实际得0
//
//	return 0;
//}


//int main()
//{
//	int a = -10;
//	int b = 10;
//	//00000000 00000000 00000000 00001010
//	//00 00 00 0a
//	// 
//	//10000000 00000000 00000000 00001010 - 原码
//	//11111111 11111111 11111111 11110101 - 反码
//	//11111111 11111111 11111111 11110110 - 补码
//	//ff ff ff f6
//
//
//	return 0;
//}


//大端字节序和小端字节序
//
//int main()
//{
//	int a = 0x11223344;
//
//	return 0;
//}

//int check_sys()
//{
//	int a = 1;
//	char* p = (char*)&a;
//	if (*p == 1)
//	{
//		return 1
//	}
//	else
//	{
//		return 0;
//	}
//}

//int check_sys()
//{
//	int a = 1;
//	char* p = (char*)&a;
//	return *p;//返回1表示小端，返回0表示大端
//}
//
//int main()
//{
//	//写代码判断当前机器的字节序
//	int ret = check_sys();
//	if (ret == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//
//	return 0;
//}


//#include <stdio.h>
//int main()
//{
//	char a = -1;
//	//10000000000000000000000000000001
//	//11111111111111111111111111111110
//	//11111111111111111111111111111111
//	//11111111
//	//11111111111111111111111111111111     整形提升补符号位
//
//	signed char b = -1;
//	//11111111
//
//	unsigned char c = -1;
//	//11111111
//	//00000000000000000000000011111111     整形提升补符号位
//
//	printf("a=%d,b=%d,c=%d", a, b, c);
//
//	return 0;
//}

//补充
//1. char 到底是signed char 还是unsigned char？
//C语言标准并没有规定，取决于编译器
//int 是 signed int
//short 是 signed short


//int main()
//{
//	char a = -128;
//	//10000000000000000000000010000000
//	//11111111111111111111111101111111
//	//11111111111111111111111110000000 - 补码
//	//10000000
//	//11111111111111111111111110000000 - 4,294,967,168
//
//	printf("%u\n", a);
//	return 0;
//}


//#include <stdio.h>
//int main()
//{
//	char a = 128;
//	//00000000000000000000000010000000
//	//10000000
//	//11111111111111111111111110000000
//	printf("%u\n", a);
//	return 0;
//}


//char类型变量的取值范围



//int main()
//{
//	int i = -20;
//	//10000000 00000000 00000000 00010100
//	//11111111 11111111 11111111 11101011
//	//11111111 11111111 11111111 11101100
//
//	//00000000 00000000 00000000 00001010
//
//	//11111111 11111111 11111111 11110110
//
//	//11111111 11111111 11111111 11110101
//	//10000000 00000000 00000000 00001010 = -10
//	unsigned int j = 10;
//
//	printf("%d\n", i + j);
//
//	return 0;
//}


//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//	}
//
//	return 0;
//}


//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	//-1 -2 -3 ... -127 -128 127 126 125 ... 3 2 1 0 -1 -2 ... -127 -128 127 ...
//	printf("%d", strlen(a));//找到\0就停止
//
//	return 0;
//}


unsigned char i = 0;
int main()
{
	for (i = 0; i <= 255; i++)
	{
		printf("hello world\n");
	}
	return 0;
}