#define _CRT_SECURE_NO_WARNINGS

#include <stdio.h>

//整形家族
//浮点型家族
//构造类型 - 自定义类型
//	数组
//	struct 结构体类型
//	enum 枚举
//	union 联合体
// 
//指针类型
// 
//空类型
//void
//函数返回类型 void test()
//函数参数void test(void)
//指针 void* p
//int main()
//{
//	int arr[10];//int [10]
//	int arr2[5];//int [5]
//
//	return 0;
//}


//int main()
//{
//	int a = -10;
//	//
//	//10000000 00000000 00000000 00001010 - 原码
//	//11111111 11111111 11111111 11110101 - 反码
//	//11111111 11111111 11111111 11110110 - 补码
//	//ff ff ff f6
//
//
//	return 0;
//}

//数据在内存中以二进制的形式存储
//对于整数来说：
//整数二进制有3种表示形式：原码、反码、补码
//正整数：原码、反码、补码相同
//负整数：原码、反码、补码要进行计算的
//按照数据的数值直接写出的二进制序列就是原码
//原码的符号位不变，其他位按位取反，得到的就是反码
//反码+1，得到的就是反码
//整数在内存中存储的是补码


//int main()
//{
//	//1 - 1;
//	//1 + (-1)
//	//补码相加
//	//00000000 00000000 00000000 00000001 
//	//11111111 11111111 11111111 11111111
//	//10000000 00000000 00000000 00000000 0 进1多一位，丢去
//	//00000000 00000000 00000000 00000000 
//	//
//	//-1的原码、反码、补码
//	//10000000 00000000 00000000 00000001
//	//11111111 11111111 11111111 11111110
//	//11111111 11111111 11111111 11111111
//	//  
//	//原码进行计算
//	//00000000 00000000 00000000 00000001
//	//10000000 00000000 00000000 00000001
//	//10000000 00000000 00000000 00000010
//	//
//	//-2 错误，实际得0
//
//	return 0;
//}


//int main()
//{
//	int a = -10;
//	int b = 10;
//	//00000000 00000000 00000000 00001010
//	//00 00 00 0a
//	// 
//	//10000000 00000000 00000000 00001010 - 原码
//	//11111111 11111111 11111111 11110101 - 反码
//	//11111111 11111111 11111111 11110110 - 补码
//	//ff ff ff f6
//
//
//	return 0;
//}


//大端字节序和小端字节序
//
int main()
{
	int a = 0x11223344;

	return 0;
}